# Init

In [120]:
import pandas as pd
import pandas_profiling
import numpy as np
from IPython.display import display
%matplotlib inline

In [25]:
column_types = {  
    'PassengerId': 'int32',
    'Pclass': 'category',
    'Sex': 'category',
    'Age': 'float32',
    'SibSp': 'int8',
    'Parch': 'int8',
    'Fare': 'Float64',
    'Embarked': 'category',
    'Survived': 'category'
}
train = pd.read_csv('data/train.csv', dtype=column_types, index_col='PassengerId')
test = pd.read_csv('data/test.csv', dtype=column_types, index_col='PassengerId')
display(train.head())
display(test.head())

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# FAQ

In [29]:
display(train.info()), display(train.info(memory_usage='deep'))

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
Survived    891 non-null category
Pclass      891 non-null category
Name        891 non-null object
Sex         891 non-null category
Age         714 non-null float32
SibSp       891 non-null int8
Parch       891 non-null int8
Ticket      891 non-null object
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null category
dtypes: category(4), float32(1), float64(1), int8(2), object(3)
memory usage: 43.6+ KB

None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
Survived    891 non-null category
Pclass      891 non-null category
Name        891 non-null object
Sex         891 non-null category
Age         714 non-null float32
SibSp       891 non-null int8
Parch       891 non-null int8
Ticket      891 non-null object
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null category
dtypes: category(4), float32(1), float64(1), int8(2), object(3)
memory usage: 185.3 KB

None

(None, None)

In [ ]:
train.info(memory_usage='deep')

In [14]:
pd.date_range('20130101', periods=5, name='magic')

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05'],
              dtype='datetime64[ns]', name='magic', freq='D')

In [28]:
train.index, train.columns, train.values

(Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
             ...
             882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
            dtype='int64', name='PassengerId', length=891),
 Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
        'Fare', 'Cabin', 'Embarked'],
       dtype='object'),
 array([['0', '3', 'Braund, Mr. Owen Harris', ..., 7.25, nan, 'S'],
        ['1', '1', 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
         ..., 71.2833, 'C85', 'C'],
        ['1', '3', 'Heikkinen, Miss. Laina', ..., 7.925, nan, 'S'],
        ...,
        ['0', '3', 'Johnston, Miss. Catherine Helen "Carrie"', ..., 23.45,
         nan, 'S'],
        ['1', '1', 'Behr, Mr. Karl Howell', ..., 30.0, 'C148', 'C'],
        ['0', '3', 'Dooley, Mr. Patrick', ..., 7.75, nan, 'Q']], dtype=object))

In [30]:
train.describe()

              Age       SibSp       Parch        Fare
count  714.000000  891.000000  891.000000  891.000000
mean    29.699118    0.523008    0.381594   32.204208
std     14.526491    1.102743    0.806057   49.693429
min      0.420000    0.000000    0.000000    0.000000
25%     20.125000    0.000000    0.000000    7.910400
50%     28.000000    0.000000    0.000000   14.454200
75%     38.000000    1.000000    0.000000   31.000000
max     80.000000    8.000000    6.000000  512.329200

In [31]:
train.T

PassengerId,1,2,3,4,5,6,7,8,9,10,...,882,883,884,885,886,887,888,889,890,891
Survived,0,1,1,1,0,0,0,0,1,1,...,0,0,0,0,0,0,1,0,1,0
Pclass,3,1,3,1,3,3,1,3,3,2,...,3,3,2,3,3,2,1,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)","Allen, Mr. William Henry","Moran, Mr. James","McCarthy, Mr. Timothy J","Palsson, Master. Gosta Leonard","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Nasser, Mrs. Nicholas (Adele Achem)",...,"Markun, Mr. Johann","Dahlberg, Miss. Gerda Ulrika","Banfield, Mr. Frederick James","Sutehall, Mr. Henry Jr","Rice, Mrs. William (Margaret Norton)","Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen ""Carrie""","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"
Sex,male,female,female,female,male,male,male,male,female,female,...,male,female,male,male,female,male,female,female,male,male
Age,22,38,26,35,35,NaN,54,2,27,14,...,33,22,28,25,39,27,19,NaN,26,32
SibSp,1,1,0,1,0,0,0,3,0,1,...,0,0,0,0,0,0,0,1,0,0
Parch,0,0,0,0,0,0,0,1,2,0,...,0,0,0,0,5,0,0,2,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282,113803,373450,330877,17463,349909,347742,237736,...,349257,7552,C.A./SOTON 34068,SOTON/OQ 392076,382652,211536,112053,W./C. 6607,111369,370376
Fare,7.25,71.2833,7.925,53.1,8.05,8.4583,51.8625,21.075,11.1333,30.0708,...,7.8958,10.5167,10.5,7.05,29.125,13,30,23.45,30,7.75
Cabin,NaN,C85,NaN,C123,NaN,NaN,E46,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,B42,NaN,C148,NaN
Embarked,S,C,S,S,S,Q,S,S,S,C,...,S,S,S,S,Q,S,S,S,C,Q

In [36]:
train.sort_index(axis=0, ascending=False).head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S

In [37]:
train.sort_index(axis=1, ascending=False).head()

,Ticket,Survived,SibSp,Sex,Pclass,Parch,Name,Fare,Embarked,Cabin,Age
PassengerId,,,,,,,,,,,
1,A/5 21171,0,1,male,3,0,"Braund, Mr. Owen Harris",7.2500,S,NaN,22.0
2,PC 17599,1,1,female,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",71.2833,C,C85,38.0
3,STON/O2. 3101282,1,0,female,3,0,"Heikkinen, Miss. Laina",7.9250,S,NaN,26.0
4,113803,1,1,female,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",53.1000,S,C123,35.0
5,373450,0,0,male,3,0,"Allen, Mr. William Henry",8.0500,S,NaN,35.0

In [45]:
train[train.Survived == '1'].sort_values(by='Age', ascending=False).head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S

In [49]:
train.loc[631 : 635, ['Survived', 'Name'] ]

            Survived                                  Name
PassengerId
631                1  Barkworth, Mr. Algernon Henry Wilson
632                0           Lundahl, Mr. Johan Svensson
633                1             Stahelin-Maeglin, Dr. Max
634                0         Parr, Mr. William Henry Marsh
635                0                    Skoog, Miss. Mabel

In [50]:
train.at[631, 'Name']

'Barkworth, Mr. Algernon Henry Wilson'

In [53]:
train.iloc[1:2, :]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [64]:
d=pd.DataFrame(np.random.randn(5), columns=list('A'))
display(d)
d['B']=pd.Series(np.random.randn(5), index=np.arange(2, 7)) 
d

          A
0 -0.495667
1 -1.352493
2 -0.463230
3 -0.671467
4  0.294855

          A         B
0 -0.495667       NaN
1 -1.352493       NaN
2 -0.463230  0.691833
3 -0.671467  0.815392
4  0.294855  0.789213

In [73]:
display(train.shift(-2).head())
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
2,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
3,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S
4,0,3,"Moran, Mr. James",male,NaN,0.0,0.0,330877,8.4583,NaN,Q
5,0,1,"McCarthy, Mr. Timothy J",male,54.0,0.0,0.0,17463,51.8625,E46,S

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [83]:
pd.Series(np.arange(1, 5)).shift(2).shift(-1)

0    NaN
1    1.0
2    2.0
3    NaN
dtype: float64

In [96]:
train.SibSp.sum(), train.Parch.sum()

(466, 340)

In [132]:
a=pd.concat([ train.describe().add_suffix('_train'), test.describe().add_suffix('_test'), pd.concat([train, test]).describe()], axis=1)
a = a.reindex_axis(sorted(a.columns), axis=1)
a

,Age,Age_test,Age_train,Fare,Fare_test,Fare_train,Parch,Parch_test,Parch_train,SibSp,SibSp_test,SibSp_train
count,1046.000000,332.000000,714.000000,1308.000000,417.000000,891.000000,1309.000000,418.000000,891.000000,1309.000000,418.000000,891.000000
mean,29.881138,30.272591,29.699118,33.295479,35.627188,32.204208,0.385027,0.392344,0.381594,0.498854,0.447368,0.523008
std,14.413494,14.181209,14.526491,51.758668,55.907576,49.693429,0.865560,0.981429,0.806057,1.041658,0.896760,1.102743
min,0.170000,0.170000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,21.000000,21.000000,20.125000,7.895800,7.895800,7.910400,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,28.000000,27.000000,28.000000,14.454200,14.454200,14.454200,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,39.000000,39.000000,38.000000,31.275000,31.500000,31.000000,0.000000,0.000000,0.000000,1.000000,1.000000,1.000000
max,80.000000,76.000000,80.000000,512.329200,512.329200,512.329200,9.000000,9.000000,6.000000,8.000000,8.000000,8.000000

In [162]:
train.unstack().head()

          PassengerId
Survived  1              0
          2              1
          3              1
          4              1
          5              0
dtype: object

In [182]:
p = pd.pivot_table(train, values='Age', index=['Sex', 'Pclass'], columns=['Embarked', 'Survived'], aggfunc='mean')
p

Embarked               C                     Q                S
Survived               0          1          0     1          0          1
Sex    Pclass
female 1       50.000000  35.675674        NaN  33.0  13.500000  33.619049
       2             NaN  19.142857        NaN  30.0  36.000000  29.091667
       3       20.700001  11.045455  28.100000  17.6  23.688889  22.548388
male   1       43.049999  36.437500  44.000000   NaN  45.362499  36.121666
       2       29.500000   1.000000  57.000000   NaN  33.414474  17.094999
       3       27.555555  18.488571  28.076923  29.0  27.168478  22.933332

In [183]:
pd.pivot_table(train, values='Fare', index=['Sex', 'Pclass'], columns=['Embarked', 'Survived'], aggfunc='mean')

Embarked               C                      Q                      S  \
Survived               0           1          0          1           0
Sex    Pclass
female 1       28.712500  117.710019        NaN  90.000000  151.550000
       2             NaN   25.268457        NaN  12.350000   18.250000
       3       14.653125   14.717220  10.904633  10.084033   21.969018
male   1       80.847160  112.197806  90.000000        NaN   53.563316
       2       25.418225   25.433350  12.350000        NaN   18.997561
       3        8.720842   11.435840  11.841550  12.916667   12.758689

Embarked
Survived               1
Sex    Pclass
female 1       96.743298
       2       22.272951
       3       13.171842
male   1       51.832739
       2       20.516667
       3       17.033450

In [184]:
pd.crosstab(train.Embarked, train.Sex)

Sex       female  male
Embarked
C             73    95
Q             36    41
S            203   441

In [195]:
display(train.ix[train.Age.dropna().argsort()].head())
train.dropna().sort_values(by='Age', ascending=False).head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
640,0,3,"Thorneycroft, Mr. Percival",male,NaN,1.0,0.0,376564,16.1000,NaN,S
602,0,3,"Slabenoff, Mr. Petco",male,NaN,0.0,0.0,349214,7.8958,NaN,S
509,0,3,"Olsen, Mr. Henry Margido",male,28.0,0.0,0.0,C 4001,22.5250,NaN,S
374,0,1,"Ringhini, Mr. Sante",male,22.0,0.0,0.0,PC 17760,135.6333,NaN,C
59,1,2,"West, Miss. Constance Mirium",female,5.0,1.0,2.0,C.A. 34651,27.7500,NaN,S

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C

In [ ]:
train.